# Day Objectivies
## Date: 30-10-2019
### Pandas

In [ ]:
# pandas:-> pandas stands for "python data analysis library".
# uses:-
#  1.It is a open source library.
#  2.It is used for data manipulations and analysis.
# It deals with two different data structures.
#   1.Series ->It is used to store the data in 1-d Array.
#   2.DataFrame -> It is used to store the data in 2-d Array.

In [ ]:
import pandas as pd
data=[10,20,30]
res=pd.Series(data)
print(res)

In [3]:
data={'s1':10,'s2':20}
res=pd.Series(data)
print(res)

s1    10
s2    20
dtype: int64

In [6]:
data={'rollnumber':[510,520,530],'name':['narmada','mani','ramya'],'marks':[50,60,100]}
df=pd.DataFrame(data)
print(df)

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100

In [7]:
# To get column names using 'columns'
df.columns

Index(['rollnumber', 'name', 'marks'], dtype='object')

In [8]:
# To get only values from the Dataframes using 'values'
df.values

array([[510, 'narmada', 50],
       [520, 'mani', 60],
       [530, 'ramya', 100]], dtype=object)

In [9]:
# To access only specific column name
df['name']

0    narmada
1       mani
2      ramya
Name: name, dtype: object

In [11]:
df.values[2][2]

100

In [12]:
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100

In [13]:
df.values[1,1]

'mani'

In [14]:
# To add newrow
df.loc[3]=[540,'apssdc',45]
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100
3         540   apssdc     45

In [17]:
df=df.drop(2)

In [18]:
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
3         540   apssdc     45

In [31]:
# function to create a read data from csv file
def read_Csvdata(filepath):
    df=pd.read_csv(filepath)
    return df
read_Csvdata('studentdata.csv')

      name  rollnumber  marks
0  narmada         510     56
1   apssdc         520     45
2      sai         533     60
3  lavanya         540     70

In [33]:
res=read_Csvdata('studentdata.csv')

In [22]:
for i in df.values:
    print(i)

[510 'narmada' 50]
[520 'mani' 60]
[540 'apssdc' 45]

In [41]:
def get_row_index(filepath,rowkey):
#     df=pd.read_csv('studentdata.csv')
    for i in range(len(res.values)):
        if res.values[i][0]==rowkey or res.values[i][1]==rowkey:
            row_index=i
    return row_index
get_row_index('studentdata.csv','narmada')

0

In [39]:
def get_column_index(filepath,colkey):
    for i in range(len(res.columns)):
        if res.columns[i]==colkey:
            col_index=i
    return col_index
get_column_index('studentdata.csv','marks')

2

In [43]:
# to print specific value
def get_Specific_value(filepath,rowkey,colkey):
    ri=get_row_index(filepath,rowkey) # it return row index
    ci=get_column_index(filepath,colkey) # it return column index
    return res.values[ri][ci]
get_Specific_value('studentdata.csv','narmada','marks')

56

In [44]:
res.columns[0]

'name'

In [45]:
# Practice on Income Dataset
# Define functions for the following data points
# Combined Average Income of all states from 2005 to 2013
# Answer = 48525
# State with highest average income in the last three years
# Answer = Alaska
# State with lowest average income from 2007 to 2010(inclusive)
# Answer = Arkansas
# Print the list of all states in the same line with average income less than California
# Answer = Alabama Arizona Arkansas 
# Print the names of states based on descending order of income in the year 2009
# Answer = Alaska California Arizona Alabama Arkansas
# State with the lowest recorded income from 2005 to 2013
# Answer = Arkansas

In [57]:
df = pd.read_csv('income.csv')
df.tail(3)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [50]:
data={'name':['narmada','mani'],'marks':[100,200]}
df = pd.DataFrame(data)
df.to_csv('data5.csv',index=False)
print('success')

success

In [51]:
df

      name  marks
0  narmada    100
1     mani    200

In [54]:
df.head()

      name  marks
0  narmada    100
1     mani    200

In [53]:
df.tail(1)

   name  marks
1  mani    200

In [68]:
df=pd.read_csv('https://raw.githubusercontent.com/mastan511/Apssdc-Python-Programming/master/DataFiles/income.csv')
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [5]:
#To create series data structure
import pandas as pd
data=[10,20,30] # using to create series data structure.
sd=pd.Series(data,index=[1,2,3])
print(sd)

1    10
2    20
3    30
dtype: int64

In [6]:
data={'rn':[510,520,530],'name':['narmada','mani','ramya']}
sd=pd.Series(data)
print(sd)

rn             [510, 520, 530]
name    [narmada, mani, ramya]
dtype: object

In [12]:
# to create DataFrame data Structure.
data={'rollnumber':[510,520,530],'name':['narmada','mani','ramya']}
sd=pd.DataFrame(data)
print(sd)

   rollnumber     name
0         510  narmada
1         520     mani
2         530    ramya

In [13]:
# To print column names from the dataframe.
data={'rollnumber':[510,520,530],'name':['narmada','mani','ramya']}
df=pd.DataFrame(data)
df.columns

Index(['rollnumber', 'name'], dtype='object')

In [14]:
# To print row values from the dataframe.
df.values

array([[510, 'narmada'],
       [520, 'mani'],
       [530, 'ramya']], dtype=object)

In [15]:
df

   rollnumber     name
0         510  narmada
1         520     mani
2         530    ramya

In [21]:
# To get row values based on column name.
df['rollnumber']

0    510
1    520
2    530
Name: rollnumber, dtype: int64

In [24]:
# To print length of dataframe
print(len(df))

3

In [23]:
df

   rollnumber     name
0         510  narmada
1         520     mani
2         530    ramya

In [34]:
# To add new row
df.loc[3]=[511,'mastan']
df

ValueError: Must have equal len keys and value when setting with an iterable

In [44]:
# To update the row value
df.loc[2,'rollnumber']=545
# row value->530 ==> 545
# l=[10,20,30]
#df

In [45]:
df

   rollnumber     name      0
0         510  narmada    NaN
1         520     mani    NaN
2         545    ramya  545.0
3         511   mastan    NaN

In [46]:
data={'rollnumber':[510,520,530],'name':['narmada','mani','nethra'],'marks':[45,35,80]}
df=pd.DataFrame(data)
df

   rollnumber     name  marks
0         510  narmada     45
1         520     mani     35
2         530   nethra     80

In [54]:
# To print only getting above 35 marks students record.
df=df[df['marks']>35]
df

   rollnumber     name  marks
0         510  narmada     45
2         530   nethra     80

In [55]:
df

   rollnumber     name  marks
0         510  narmada     45
2         530   nethra     80

In [56]:
# To delete values based on row index.
df=df.drop(2)
df

   rollnumber     name  marks
0         510  narmada     45

In [63]:
# To delete a column 
df=df.drop('name',axis=1)

In [64]:
df

   rollnumber
0         510

In [65]:
data={'rn':[510,520,530,540,550,560],'telugu':[50,48,78,90,75,30],'english':[20,50,80,60,45,12]}
df = pd.DataFrame(data)
df

    rn  telugu  english
0  510      50       20
1  520      48       50
2  530      78       80
3  540      90       60
4  550      75       45
5  560      30       12

In [69]:
# To print first row record
df.head(2) # it return n number of records.
           # head()->It returns top five records in the database.

    rn  telugu  english
0  510      50       20
1  520      48       50

In [73]:
# To print last row
df.tail() # it return n number of records.
           # head()->It returns last five records in the database.

    rn  telugu  english
1  520      48       50
2  530      78       80
3  540      90       60
4  550      75       45
5  560      30       12

In [74]:
df

    rn  telugu  english
0  510      50       20
1  520      48       50
2  530      78       80
3  540      90       60
4  550      75       45
5  560      30       12

In [79]:
# dataframe data write into record.csv file
df.to_csv('DataFiles/record.csv',index=False)
print("Success")

Success

In [100]:
# to read from the file
res=pd.read_csv('DataFiles/record.csv')
res

    rn  telugu  english
0  510      50       20
1  520      48       50
2  530      78       80
3  540      90       60
4  550      75       45
5  560      30       12

In [98]:
df

    rn  telugu  english
0  510      50       20
1  520      48       50
2  530      78       80
3  540      90       60
4  550      75       45
5  560      30       12

In [95]:
# To get column index
def get_column_index(filepath,colkey):
    for i in range(len(df.columns)):
        if df.columns[i]==colkey:
            col_index=i
    return col_index
get_column_index('record.csv','telugu')

1

In [104]:
# to row index
def get_row_index(filepath,rowkey):
    for i in range(len(res.values)):
        if res.values[i][0]==rowkey or res.values[i][1]==rowkey:
            row_index=i
    return row_index
get_row_index('record.csv',540)
def specific_value(filepath,rowkey,colkey):
    ri=get_row_index(filepath,rowkey)
    ci=get_column_index(filepath,colkey)
    return res.values[ri][ci]
specific_value('record.csv',540,'telugu')

90

In [102]:
res

    rn  telugu  english
0  510      50       20
1  520      48       50
2  530      78       80
3  540      90       60
4  550      75       45
5  560      30       12